Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J20.xml
<?xml version="1.0" encoding="UTF-8"?>

<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2015, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->

<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAMS70J20-XX" package="LQ64" speedmax="266" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
    <variant ordercode="ATSAMS70J20-CU" package="TFBGA64" speedmax="266" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M7" family="SAMS" name="ATSAMS70J20" series="SAMS70">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="QSPIMEM" start="0x80000000" size="0x20000000" type="other"/>
          <memory-segment name="AXIMX" start="0xA0000000" size="0x00100000" type="other"/>
          <memory-segment name="ITCM" start="0x00000000" size="0x00200000" type="other"/>
          <memory-segment name="IFLASH" start="0x00400000" size="0x00100000" type="flash" pagesize="512"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00004000" type="rom"/>
          <memory-segment name="DTCM" start="0x20000000" size="0x00020000" type="other"/>
          <memory-segment name="IRAM" start="0x20400000" size="0x00060000" type="ram"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other"/>
          <memory-segment name="SDRAM_CS" start="0x70000000" size="0x10000000" type="other"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x8" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ACC" version="6490G">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x40044000"/>
          </instance>
        </module>
        <module name="AES" version="6149S">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
          </instance>
        </module>
        <module name="AFEC" version="11147I">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA8" function="B" group="AFE0_ADTRG"/>
              <signal pad="PD30" function="X1" group="AFE0_AD" index="0"/>
              <signal pad="PA21" function="X1" group="AFE0_AD" index="1"/>
              <signal pad="PA21" function="X1" group="PIODCEN" index="2"/>
              <signal pad="PB3" function="X1" group="AFE0_AD" index="2"/>
              <signal pad="PB3" function="X1" group="WKUP" index="12"/>
              <signal pad="PE5" function="X1" group="AFE0_AD" index="3"/>
              <signal pad="PE4" function="X1" group="AFE0_AD" index="4"/>
              <signal pad="PB2" function="X1" group="AFE0_AD" index="5"/>
              <signal pad="PA17" function="X1" group="AFE0_AD" index="6"/>
              <signal pad="PA18" function="X1" group="AFE0_AD" index="7"/>
              <signal pad="PA19" function="X1" group="AFE0_AD" index="8"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AFE0_AD" index="9"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AFE0_AD" index="10"/>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
            </signals>
          </instance>
