Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J20.xml
      <value-group caption="" name="MATRIX_MCFG6__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG8__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module caption="Parallel Input/Output Controller" name="PIO" version="11004T">
      <register-group name="PIO">
        <register caption="PIO Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4">
          <bitfield caption="PIO Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
        </register>
