Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J20.xml
        <register caption="Host Frame Number Register" name="USBHS_HSTFNUM" offset="0x0420" rw="RW" size="4">
          <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Length" mask="0x00FF0000" name="FLENHIGH"/>
        </register>
        <register caption="Host Address 1 Register" name="USBHS_HSTADDR1" offset="0x0424" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP0"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP1"/>
          <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP2"/>
          <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP3"/>
        </register>
        <register caption="Host Address 2 Register" name="USBHS_HSTADDR2" offset="0x0428" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP4"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP5"/>
          <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP6"/>
          <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP7"/>
        </register>
        <register caption="Host Address 3 Register" name="USBHS_HSTADDR3" offset="0x042C" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP8"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP9"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 0" name="USBHS_HSTPIPCFG0" offset="0x500" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 1" name="USBHS_HSTPIPCFG1" offset="0x504" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 2" name="USBHS_HSTPIPCFG2" offset="0x508" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 3" name="USBHS_HSTPIPCFG3" offset="0x50C" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 4" name="USBHS_HSTPIPCFG4" offset="0x510" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 5" name="USBHS_HSTPIPCFG5" offset="0x514" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 6" name="USBHS_HSTPIPCFG6" offset="0x518" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 7" name="USBHS_HSTPIPCFG7" offset="0x51C" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 8" name="USBHS_HSTPIPCFG8" offset="0x520" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 9" name="USBHS_HSTPIPCFG9" offset="0x524" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="USBHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="USBHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="USBHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="USBHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 0" name="USBHS_HSTPIPISR0" offset="0x530" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 1" name="USBHS_HSTPIPISR1" offset="0x534" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 2" name="USBHS_HSTPIPISR2" offset="0x538" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 3" name="USBHS_HSTPIPISR3" offset="0x53C" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 4" name="USBHS_HSTPIPISR4" offset="0x540" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
