Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70J20.xml
        <register caption="UTMI Clock Trimming Register" name="UTMI_CKTRIM" offset="0x30" rw="RW" size="4">
          <bitfield caption="UTMI Reference Clock Frequency" mask="0x00000003" name="FREQ" values="UTMI_CKTRIM__FREQ"/>
        </register>
      </register-group>
      <value-group caption="" name="UTMI_CKTRIM__FREQ">
        <value caption="12 MHz reference clock" name="XTAL12" value="0"/>
        <value caption="16 MHz reference clock" name="XTAL16" value="1"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT" version="6080I">
      <register-group name="WDT">
        <register caption="Control Register" name="WDT_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT_CR__KEY"/>
        </register>
        <register caption="Mode Register" name="WDT_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
          <bitfield caption="Watchdog Fault Interrupt Enable" mask="0x00001000" name="WDFIEN"/>
          <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
          <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
          <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
          <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
        </register>
        <register caption="Status Register" name="WDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow (cleared on read)" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error (cleared on read)" mask="0x00000002" name="WDERR"/>
        </register>
      </register-group>
      <value-group caption="" name="WDT_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module caption="Extensible DMA Controller" name="XDMAC" version="11161D">
      <register-group name="XDMAC">
        <register caption="Global Type Register" name="XDMAC_GTYPE" offset="0x00" rw="RW" size="4">
          <bitfield caption="Number of Channels Minus One" mask="0x0000001F" name="NB_CH"/>
          <bitfield caption="Number of Bytes" mask="0x0000FFE0" name="FIFO_SZ"/>
          <bitfield caption="Number of Peripheral Requests Minus One" mask="0x007F0000" name="NB_REQ"/>
        </register>
        <register caption="Global Configuration Register" name="XDMAC_GCFG" offset="0x04" rw="R" size="4">
          <bitfield caption="Configuration Registers Clock Gating Disable" mask="0x00000001" name="CGDISREG"/>
          <bitfield caption="Pipeline Clock Gating Disable" mask="0x00000002" name="CGDISPIPE"/>
          <bitfield caption="FIFO Clock Gating Disable" mask="0x00000004" name="CGDISFIFO"/>
          <bitfield caption="Bus Interface Clock Gating Disable" mask="0x00000008" name="CGDISIF"/>
          <bitfield caption="Boundary X Kilo byte Enable" mask="0x00000100" name="BXKBEN"/>
        </register>
        <register caption="Global Weighted Arbiter Configuration Register" name="XDMAC_GWAC" offset="0x08" rw="RW" size="4">
          <bitfield caption="Pool Weight 0" mask="0x0000000F" name="PW0"/>
          <bitfield caption="Pool Weight 1" mask="0x000000F0" name="PW1"/>
          <bitfield caption="Pool Weight 2" mask="0x00000F00" name="PW2"/>
          <bitfield caption="Pool Weight 3" mask="0x0000F000" name="PW3"/>
        </register>
        <register caption="Global Interrupt Enable Register" name="XDMAC_GIE" offset="0x0C" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Interrupt Enable Bit" mask="0x00000001" name="IE0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Enable Bit" mask="0x00000002" name="IE1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Enable Bit" mask="0x00000004" name="IE2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Enable Bit" mask="0x00000008" name="IE3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Enable Bit" mask="0x00000010" name="IE4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Enable Bit" mask="0x00000020" name="IE5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Enable Bit" mask="0x00000040" name="IE6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Enable Bit" mask="0x00000080" name="IE7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Enable Bit" mask="0x00000100" name="IE8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Enable Bit" mask="0x00000200" name="IE9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Enable Bit" mask="0x00000400" name="IE10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Enable Bit" mask="0x00000800" name="IE11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Enable Bit" mask="0x00001000" name="IE12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Enable Bit" mask="0x00002000" name="IE13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Enable Bit" mask="0x00004000" name="IE14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Enable Bit" mask="0x00008000" name="IE15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Enable Bit" mask="0x00010000" name="IE16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Enable Bit" mask="0x00020000" name="IE17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Enable Bit" mask="0x00040000" name="IE18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Enable Bit" mask="0x00080000" name="IE19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Enable Bit" mask="0x00100000" name="IE20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Enable Bit" mask="0x00200000" name="IE21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Enable Bit" mask="0x00400000" name="IE22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Enable Bit" mask="0x00800000" name="IE23"/>
        </register>
        <register caption="Global Interrupt Disable Register" name="XDMAC_GID" offset="0x10" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Interrupt Disable Bit" mask="0x00000001" name="ID0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Disable Bit" mask="0x00000002" name="ID1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Disable Bit" mask="0x00000004" name="ID2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Disable Bit" mask="0x00000008" name="ID3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Disable Bit" mask="0x00000010" name="ID4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Disable Bit" mask="0x00000020" name="ID5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Disable Bit" mask="0x00000040" name="ID6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Disable Bit" mask="0x00000080" name="ID7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Disable Bit" mask="0x00000100" name="ID8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Disable Bit" mask="0x00000200" name="ID9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Disable Bit" mask="0x00000400" name="ID10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Disable Bit" mask="0x00000800" name="ID11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Disable Bit" mask="0x00001000" name="ID12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Disable Bit" mask="0x00002000" name="ID13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Disable Bit" mask="0x00004000" name="ID14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Disable Bit" mask="0x00008000" name="ID15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Disable Bit" mask="0x00010000" name="ID16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Disable Bit" mask="0x00020000" name="ID17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Disable Bit" mask="0x00040000" name="ID18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Disable Bit" mask="0x00080000" name="ID19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Disable Bit" mask="0x00100000" name="ID20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Disable Bit" mask="0x00200000" name="ID21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Disable Bit" mask="0x00400000" name="ID22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Disable Bit" mask="0x00800000" name="ID23"/>
        </register>
        <register caption="Global Interrupt Mask Register" name="XDMAC_GIM" offset="0x14" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Interrupt Mask Bit" mask="0x00000001" name="IM0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Mask Bit" mask="0x00000002" name="IM1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Mask Bit" mask="0x00000004" name="IM2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Mask Bit" mask="0x00000008" name="IM3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Mask Bit" mask="0x00000010" name="IM4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Mask Bit" mask="0x00000020" name="IM5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Mask Bit" mask="0x00000040" name="IM6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Mask Bit" mask="0x00000080" name="IM7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Mask Bit" mask="0x00000100" name="IM8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Mask Bit" mask="0x00000200" name="IM9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Mask Bit" mask="0x00000400" name="IM10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Mask Bit" mask="0x00000800" name="IM11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Mask Bit" mask="0x00001000" name="IM12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Mask Bit" mask="0x00002000" name="IM13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Mask Bit" mask="0x00004000" name="IM14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Mask Bit" mask="0x00008000" name="IM15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Mask Bit" mask="0x00010000" name="IM16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Mask Bit" mask="0x00020000" name="IM17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Mask Bit" mask="0x00040000" name="IM18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Mask Bit" mask="0x00080000" name="IM19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Mask Bit" mask="0x00100000" name="IM20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Mask Bit" mask="0x00200000" name="IM21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Mask Bit" mask="0x00400000" name="IM22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Mask Bit" mask="0x00800000" name="IM23"/>
        </register>
        <register caption="Global Interrupt Status Register" name="XDMAC_GIS" offset="0x18" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Interrupt Status Bit" mask="0x00000001" name="IS0"/>
          <bitfield caption="XDMAC Channel 1 Interrupt Status Bit" mask="0x00000002" name="IS1"/>
          <bitfield caption="XDMAC Channel 2 Interrupt Status Bit" mask="0x00000004" name="IS2"/>
          <bitfield caption="XDMAC Channel 3 Interrupt Status Bit" mask="0x00000008" name="IS3"/>
          <bitfield caption="XDMAC Channel 4 Interrupt Status Bit" mask="0x00000010" name="IS4"/>
          <bitfield caption="XDMAC Channel 5 Interrupt Status Bit" mask="0x00000020" name="IS5"/>
          <bitfield caption="XDMAC Channel 6 Interrupt Status Bit" mask="0x00000040" name="IS6"/>
          <bitfield caption="XDMAC Channel 7 Interrupt Status Bit" mask="0x00000080" name="IS7"/>
          <bitfield caption="XDMAC Channel 8 Interrupt Status Bit" mask="0x00000100" name="IS8"/>
          <bitfield caption="XDMAC Channel 9 Interrupt Status Bit" mask="0x00000200" name="IS9"/>
          <bitfield caption="XDMAC Channel 10 Interrupt Status Bit" mask="0x00000400" name="IS10"/>
          <bitfield caption="XDMAC Channel 11 Interrupt Status Bit" mask="0x00000800" name="IS11"/>
          <bitfield caption="XDMAC Channel 12 Interrupt Status Bit" mask="0x00001000" name="IS12"/>
          <bitfield caption="XDMAC Channel 13 Interrupt Status Bit" mask="0x00002000" name="IS13"/>
          <bitfield caption="XDMAC Channel 14 Interrupt Status Bit" mask="0x00004000" name="IS14"/>
          <bitfield caption="XDMAC Channel 15 Interrupt Status Bit" mask="0x00008000" name="IS15"/>
          <bitfield caption="XDMAC Channel 16 Interrupt Status Bit" mask="0x00010000" name="IS16"/>
          <bitfield caption="XDMAC Channel 17 Interrupt Status Bit" mask="0x00020000" name="IS17"/>
          <bitfield caption="XDMAC Channel 18 Interrupt Status Bit" mask="0x00040000" name="IS18"/>
          <bitfield caption="XDMAC Channel 19 Interrupt Status Bit" mask="0x00080000" name="IS19"/>
          <bitfield caption="XDMAC Channel 20 Interrupt Status Bit" mask="0x00100000" name="IS20"/>
          <bitfield caption="XDMAC Channel 21 Interrupt Status Bit" mask="0x00200000" name="IS21"/>
          <bitfield caption="XDMAC Channel 22 Interrupt Status Bit" mask="0x00400000" name="IS22"/>
          <bitfield caption="XDMAC Channel 23 Interrupt Status Bit" mask="0x00800000" name="IS23"/>
        </register>
        <register caption="Global Channel Enable Register" name="XDMAC_GE" offset="0x1C" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Enable Bit" mask="0x00000001" name="EN0"/>
          <bitfield caption="XDMAC Channel 1 Enable Bit" mask="0x00000002" name="EN1"/>
          <bitfield caption="XDMAC Channel 2 Enable Bit" mask="0x00000004" name="EN2"/>
          <bitfield caption="XDMAC Channel 3 Enable Bit" mask="0x00000008" name="EN3"/>
          <bitfield caption="XDMAC Channel 4 Enable Bit" mask="0x00000010" name="EN4"/>
          <bitfield caption="XDMAC Channel 5 Enable Bit" mask="0x00000020" name="EN5"/>
          <bitfield caption="XDMAC Channel 6 Enable Bit" mask="0x00000040" name="EN6"/>
          <bitfield caption="XDMAC Channel 7 Enable Bit" mask="0x00000080" name="EN7"/>
          <bitfield caption="XDMAC Channel 8 Enable Bit" mask="0x00000100" name="EN8"/>
          <bitfield caption="XDMAC Channel 9 Enable Bit" mask="0x00000200" name="EN9"/>
          <bitfield caption="XDMAC Channel 10 Enable Bit" mask="0x00000400" name="EN10"/>
          <bitfield caption="XDMAC Channel 11 Enable Bit" mask="0x00000800" name="EN11"/>
          <bitfield caption="XDMAC Channel 12 Enable Bit" mask="0x00001000" name="EN12"/>
          <bitfield caption="XDMAC Channel 13 Enable Bit" mask="0x00002000" name="EN13"/>
          <bitfield caption="XDMAC Channel 14 Enable Bit" mask="0x00004000" name="EN14"/>
          <bitfield caption="XDMAC Channel 15 Enable Bit" mask="0x00008000" name="EN15"/>
          <bitfield caption="XDMAC Channel 16 Enable Bit" mask="0x00010000" name="EN16"/>
          <bitfield caption="XDMAC Channel 17 Enable Bit" mask="0x00020000" name="EN17"/>
          <bitfield caption="XDMAC Channel 18 Enable Bit" mask="0x00040000" name="EN18"/>
          <bitfield caption="XDMAC Channel 19 Enable Bit" mask="0x00080000" name="EN19"/>
          <bitfield caption="XDMAC Channel 20 Enable Bit" mask="0x00100000" name="EN20"/>
          <bitfield caption="XDMAC Channel 21 Enable Bit" mask="0x00200000" name="EN21"/>
          <bitfield caption="XDMAC Channel 22 Enable Bit" mask="0x00400000" name="EN22"/>
          <bitfield caption="XDMAC Channel 23 Enable Bit" mask="0x00800000" name="EN23"/>
        </register>
